[
  {
    "name": "A.D. International School",
    "link": "https://www.cbseschool.org/a-d-international-school-uttar-pradesh/",
    "description": "Founded in 2016,A.D. International Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133105. Address of the school is: Kakrari,kakua Deori Road Agra Up. Email address of the school is adinternationalschooll@gmail.com. The school is being managed by Anguri Devi Shiksha Samiti.Read More"
  },
  {
    "name": "Abhinav Vidyalaya Bijoli",
    "link": "https://www.cbseschool.org/abhinav-vidyalaya-bijoli-uttar-pradesh/",
    "description": "Founded in 2007,Abhinav Vidyalaya Bijoliis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2120028. Address of the school is: Block- Bah, Distt. Agra, Division Agra Up. Email address of the school is qybhavan@yahoo.co.in. The school is being managed by Bharatiya Vidya Bhavan,mumbai.Read More"
  },
  {
    "name": "Agra Public School",
    "link": "https://www.cbseschool.org/agra-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1965,Agra Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130077. Address of the school is: Artoni Agra Uttar Pradesh. Email address of the school is dsvrma@rediffmail.com. The school is being managed by Shri Mahesh Chandra Sharma.Read More"
  },
  {
    "name": "Agra Public School 8-10 Old Vijay Nagar",
    "link": "https://www.cbseschool.org/agra-public-school-8-10-old-vijay-nagar-uttar-pradesh/",
    "description": "Founded in 2011,Agra Public School 8-10 Old Vijay Nagaris a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133174. Address of the school is: 8-10 Old Vijay Nagar Colony Agra-282004 Up. Email address of the school is abhinavsharma0002@gmail.com. The school is being managed by Agra Public Institutional Welfare Society.Read More"
  },
  {
    "name": "Agra Vanasthali Vidyalaya",
    "link": "https://www.cbseschool.org/agra-vanasthali-vidyalaya-agra-uttar-pradesh/",
    "description": "Founded in 2004,Agra Vanasthali Vidyalayais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130789. Address of the school is: Jharna Nala Chalesar Ferozabad Road Agra Up. Email address of the school is AVVAGRA@GMAIL.COM. The school is being managed by Shri Puran Chand Mittal Mem Society.Read More"
  },
  {
    "name": "Air Fce School",
    "link": "https://www.cbseschool.org/air-fce-school-uttar-pradesh/",
    "description": "Founded in 1963,Air Fce Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2180004. Address of the school is: Air Fce Station Agra Uttar Pradesh. Email address of the school is josephskt@sancharnet.in. The school is being managed by A F S Agra.Read More"
  },
  {
    "name": "Alaknanda Academic School",
    "link": "https://www.cbseschool.org/alaknanda-academic-school-agra-uttar-pradesh/",
    "description": "Founded in 2014,Alaknanda Academic Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131840. Address of the school is: Semri Tal,deori Road Agra. Email address of the school is alaknandaschool@gmail.com. The school is being managed by Raj Foundation.Read More"
  },
  {
    "name": "All Saints School",
    "link": "https://www.cbseschool.org/all-saints-school-agra-uttar-pradesh/",
    "description": "Founded in 2005,All Saints Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131023. Address of the school is: Kahrai, Near T. V. Tower, Shamshabad Road, Agra. Email address of the school is chauhanramanand.s@gmail.com. The school is being managed by All Saints School Shiksha Samiti.Read More"
  },
  {
    "name": "Allen Convent School",
    "link": "https://www.cbseschool.org/allen-convent-school-uttar-pradesh/",
    "description": "Founded in 2014,Allen Convent Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133379. Address of the school is: H.n.khera, Ghari Jahan Singh Road , Shamshabad, Agra. Email address of the school is www.allen.convent.14@gmail.com. The school is being managed by Allen Shiksha Samiti.Read More"
  },
  {
    "name": "Army Public School",
    "link": "https://www.cbseschool.org/army-public-school-uttar-pradesh-2/",
    "description": "Founded in 1955,Army Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2180005. Address of the school is: Agra Cantt Uttar Pradesh. Email address of the school is rajkumar@nda.vsnl.net.in. The school is being managed by Station Hq Agra Cantt.Read More"
  },
  {
    "name": "Avmd Institute",
    "link": "https://www.cbseschool.org/avmd-institute-agra-uttar-pradesh/",
    "description": "Founded in 2011,Avmd Instituteis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131834. Address of the school is: 277 Sawai-bhawai Road,villege-sawai Tehsil-etmadpur,agra. Email address of the school is avmdinstitute@gmail.com. The school is being managed by Avmd Institute.Read More"
  },
  {
    "name": "Balmukund Ramchandra Bazari Saraswati Vidya Mandir",
    "link": "https://www.cbseschool.org/balmukund-ramchandra-bazari-saraswati-vidya-mandir-agra-uttar-pradesh/",
    "description": "Founded in 1962,Balmukund Ramchandra Bazari Saraswati Vidya Mandiris a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130349. Address of the school is: Rankta Rly Station Po Artoni Agra Uttar Pradesh. Email address of the school is brbsvm@rediffmail.com. The school is being managed by Ram Saraswati Vidya Mandir Society.Read More"
  },
  {
    "name": "Baluni Public School",
    "link": "https://www.cbseschool.org/baluni-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2013,Baluni Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131966. Address of the school is: Vill-sikanderpur Mustkil,post-dayal Bagh,agra Up. Email address of the school is principal.bpsagra@gmail.com. The school is being managed by Dr. Baluni Education Society.Read More"
  },
  {
    "name": "Baluni Public School",
    "link": "https://www.cbseschool.org/baluni-public-school-uttar-pradesh/",
    "description": "Founded in 2014,Baluni Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132612. Address of the school is: Deori Road Agra. Email address of the school is deoribps@gmail.com. The school is being managed by Dr Baluni Education Society.Read More"
  },
  {
    "name": "Bhartiya Bal Vidya Mandir School",
    "link": "https://www.cbseschool.org/bhartiya-bal-vidya-mandir-school-agra-uttar-pradesh/",
    "description": "Founded in 2007,Bhartiya Bal Vidya Mandir Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131108. Address of the school is: Ansal Town, Bagda Road, Baroli Aheer, Shamsabad Road. Email address of the school is bbvmsumit@hotmail.com. The school is being managed by Shri Tirupati Balaji Shiksha Samiti.Read More"
  },
  {
    "name": "Bhartiya Vidyapeeth Bal Bharti",
    "link": "https://www.cbseschool.org/bhartiya-vidyapeeth-bal-bharti-agra-uttar-pradesh/",
    "description": "Founded in 1994,Bhartiya Vidyapeeth Bal Bhartiis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130150. Address of the school is: Bihbav Nagar Agra Uttar Pradesh. Email address of the school is principalbvpagra@gmail.com. The school is being managed by Bhartiya Vidyapeeth Bal Bharti Shiksha Samiti.Read More"
  },
  {
    "name": "Boston Public School",
    "link": "https://www.cbseschool.org/boston-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2008,Boston Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131351. Address of the school is: Bodla Road, Dehtora ,sikandra. Email address of the school is NARENRAJ1966@GMAIL.COM. The school is being managed by Boston Public School Shiksha Samiti.Read More"
  },
  {
    "name": "Bps Public School",
    "link": "https://www.cbseschool.org/bps-public-school-uttar-pradesh-2/",
    "description": "Founded in 2017,Bps Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133337. Address of the school is: Kotli Bagichi, Devri Road Agra. Email address of the school is bpsschoolagra@gmail.com. The school is being managed by Bohare Pratap Singh Sikshha Samiti.Read More"
  },
  {
    "name": "C.V International School",
    "link": "https://www.cbseschool.org/c-v-international-school-agra-uttar-pradesh/",
    "description": "C.V International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131784. Address of the school is: Near Yamuna Express Way Crossing Ujrayi Khandari Agra. Email address of the school is cvinternationalschool@gmail.com.Read More"
  },
  {
    "name": "Cambridge School",
    "link": "https://www.cbseschool.org/cambridge-school-uttar-pradesh/",
    "description": "Founded in 2018,Cambridge Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133468. Address of the school is: Cambridge School Nh 2 Behind Kant Petrol Pump Near Toll Plaza. Email address of the school is cambrigepublicschool@gmail.com. The school is being managed by Cambridge Aducational Trust.Read More"
  },
  {
    "name": "Captain Narottam Singh Pancham Singh Public School",
    "link": "https://www.cbseschool.org/captain-narottam-singh-pancham-singh-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2008,Captain Narottam Singh Pancham Singh Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131185. Address of the school is: Ram Nagar, Hathras Road Khandoli Agra. Email address of the school is BEENARANI133@GAMIL.COM. The school is being managed by Captian Narottam Singh Pancham Singh Bhadouria Memorial Education Society.Read More"
  },
  {
    "name": "Central Agra Public School",
    "link": "https://www.cbseschool.org/central-agra-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1993,Central Agra Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130341. Address of the school is: Shahdara Check Post Firozabad Road Agra Uttar Pradesh. Email address of the school is hariomtrivedi342@yahoo.in. The school is being managed by Central Agra Educatinal Society.Read More"
  },
  {
    "name": "Ch Beeri Singh Public School",
    "link": "https://www.cbseschool.org/ch-beeri-singh-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2001,Ch Beeri Singh Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130608. Address of the school is: Sunder Bagh Dayal Bagh Agra Uttar Pradesh. Email address of the school is arunkumartomar55@yahoo.in. The school is being managed by Ch Beeri Singh Educational Soc.Read More"
  },
  {
    "name": "City Convent School",
    "link": "https://www.cbseschool.org/city-convent-school-agra-uttar-pradesh/",
    "description": "Founded in 2006,City Convent Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132241. Address of the school is: 34/46-b,mahadev Road,balkeshwar,agra.. Email address of the school is kratika.gupta04@gmail.com. The school is being managed by Muliya Educational Evam Social Welfare Society.Read More"
  },
  {
    "name": "Colonel's Brightland Public School",
    "link": "https://www.cbseschool.org/colonels-brightland-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1968,Colonel's Brightland Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130861. Address of the school is: Cill Lakawali Po Kalal Kheria Agra Uttar Pradesh. Email address of the school is rubinakhan39@yahoo.co.in. The school is being managed by Smt. Baleshwari Shiksha Samiti.Read More"
  },
  {
    "name": "D. S. Public School",
    "link": "https://www.cbseschool.org/d-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2005,D. S. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131781. Address of the school is: Vill. Jamal Nagar Bhains, Post Chamarola, Agra. Email address of the school is dspublicschool.agra@gmail.com. The school is being managed by Shri. Dharmajeet Singh Shikha Samiti.Read More"
  },
  {
    "name": "Dau Ji Public School",
    "link": "https://www.cbseschool.org/dau-ji-public-school-uttar-pradesh/",
    "description": "Founded in 2016,Dau Ji Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133469. Address of the school is: Mai Road Khandoli Agra. Email address of the school is SHARMAPRADIV@GMAIL.COM. The school is being managed by Agarbandu Educational Trust.Read More"
  },
  {
    "name": "Dayanand Bal Mandir",
    "link": "https://www.cbseschool.org/dayanand-bal-mandir-agra-uttar-pradesh/",
    "description": "Founded in 1973,Dayanand Bal Mandiris a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130203. Address of the school is: Sultanpura Agra Cantt Uttar Pradesh. Email address of the school is kulbirbhasin60@gmail.com. The school is being managed by Dayanand Bal Mandir.Read More"
  },
  {
    "name": "Delhi Public International School",
    "link": "https://www.cbseschool.org/delhi-public-international-school-uttar-pradesh/",
    "description": "Founded in 2016,Delhi Public International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132984. Address of the school is: Delhi Public International School, Village - Tal Semri, Deori Road Agra (u.p.). Email address of the school is infodpisagra@gmail.com. The school is being managed by Om Sai Educational Trust.Read More"
  },
  {
    "name": "Delhi Public School",
    "link": "https://www.cbseschool.org/delhi-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2002,Delhi Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130568. Address of the school is: E-2 Phase F Shastri Puram Agra Uttar Pradesh. Email address of the school is principal@dps.ac.in. The school is being managed by Sunil Charitable Society.Read More"
  },
  {
    "name": "Delhi World Public School",
    "link": "https://www.cbseschool.org/delhi-world-public-school-uttar-pradesh-4/",
    "description": "Founded in 2018,Delhi World Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133323. Address of the school is: Old Nh-2 , Etmadpur, Agra. Email address of the school is info@dwpsagra.in. The school is being managed by The Muslim Educational Welfare Society.Read More"
  },
  {
    "name": "Dr. M.P.S World School",
    "link": "https://www.cbseschool.org/dr-m-p-s-world-school-agra-uttar-pradesh/",
    "description": "Founded in 2011,Dr. M.P.S World Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131487. Address of the school is: Agra-delhi Highway,near Naveen Sabji Mandi,sikandra,agra. Email address of the school is changeclarance@gmail.com. The school is being managed by Mata Jhandewala Educational And Welfare Society.Read More"
  },
  {
    "name": "Dr. Maria Residential Academy",
    "link": "https://www.cbseschool.org/dr-maria-residential-academy-agra-uttar-pradesh/",
    "description": "Founded in 1989,Dr. Maria Residential Academyis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130103. Address of the school is: Sikandara Bodla Agra Uttar Pradesh. Email address of the school is mariamohan_06@yahoo.co.in. The school is being managed by Smt. Ramdulari Brijrajnath Tewari Sanskritik Kendra.Read More"
  },
  {
    "name": "Ess Ess Convent School",
    "link": "https://www.cbseschool.org/ess-ess-convent-school-agra-uttar-pradesh/",
    "description": "Founded in 1994,Ess Ess Convent Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130441. Address of the school is: Mauza Ghat Wasan Agra Uttar Pradesh. Email address of the school is smmishra1735@gmail.com. The school is being managed by Shishu Shiksha Society.Read More"
  },
  {
    "name": "G. D. Goenka Public School, Agra",
    "link": "https://www.cbseschool.org/g-d-goenka-public-school-agra-agra-uttar-pradesh/",
    "description": "Founded in 2011,G. D. Goenka Public School, Agrais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131364. Address of the school is: Bodla-bichpuri Road, Agra. Email address of the school is principal@gdgoenkaagra.com. The school is being managed by K.p.s. Educational Trust.Read More"
  },
  {
    "name": "G.C. Goel International School",
    "link": "https://www.cbseschool.org/g-c-goel-international-school-uttar-pradesh/",
    "description": "Founded in 2015,G.C. Goel International Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133201. Address of the school is: Agarpur, Jalesar Road, Agra. Email address of the school is gcgischool@yahoo.in. The school is being managed by Gopi Chand Agarwal Memorial Trust.Read More"
  },
  {
    "name": "G.L. School",
    "link": "https://www.cbseschool.org/g-l-school-agra-uttar-pradesh/",
    "description": "Founded in 2014,G.L. Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132098. Address of the school is: Village Mahuar, Kiraoli, Agra. Email address of the school is atulkulshrestha101@gmail.com. The school is being managed by Shri. G.l. Goyal Educational Trust.Read More"
  },
  {
    "name": "G.R. Cosmic School",
    "link": "https://www.cbseschool.org/g-r-cosmic-school-uttar-pradesh/",
    "description": "G.R. Cosmic Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133773. Address of the school is: Shamshabad Agra, Up 282009. Email address of the school is grcosmicschool2021@gmail.com. The school is being managed by G R Charitable Trust.Read More"
  },
  {
    "name": "G.S. Public School",
    "link": "https://www.cbseschool.org/g-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2012,G.S. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132026. Address of the school is: Abidgarh, Khandauli, Agra, Up. Email address of the school is gspabid@gmail.com. The school is being managed by Shri Ganpat Singh Shiksha Samiti.Read More"
  },
  {
    "name": "Ganesh Ram Nagar Saraswati Balika Vidya Mandir",
    "link": "https://www.cbseschool.org/ganesh-ram-nagar-saraswati-balika-vidya-mandir-agra-uttar-pradesh/",
    "description": "Founded in 1999,Ganesh Ram Nagar Saraswati Balika Vidya Mandiris a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130570. Address of the school is: Balkeshewar Agra Uttar Pradesh. Email address of the school is mitas64@gmail.COM. The school is being managed by Bhartiya Shiksha Samiti.Read More"
  },
  {
    "name": "Gayatri Public School",
    "link": "https://www.cbseschool.org/gayatri-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2011,Gayatri Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130817. Address of the school is: 152, Mauz Mohammedpur, Shastripuram, Agra, Up. Email address of the school is kalyanicdixit@gmail.com. The school is being managed by Gayatri Shiksha Samiti.Read More"
  },
  {
    "name": "Global Agra Convent  School",
    "link": "https://www.cbseschool.org/global-agra-convent-school-agra-uttar-pradesh/",
    "description": "Founded in 2013,Global Agra Convent  Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131901. Address of the school is: Bada Gaon Shamshabad Road,agra,up. Email address of the school is vprawat111@gmail.com. The school is being managed by Global Agra Shiksha Samiti.Read More"
  },
  {
    "name": "Glorious Public School",
    "link": "https://www.cbseschool.org/glorious-public-school-uttar-pradesh/",
    "description": "Founded in 2007,Glorious Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133177. Address of the school is: Guru Ramdas Nagar Kakretha, Agra. Email address of the school is gloriouspublic70@gmail.com. The school is being managed by Glorious Public School Samiti.Read More"
  },
  {
    "name": "Green Land Convent School",
    "link": "https://www.cbseschool.org/green-land-convent-school-agra-uttar-pradesh/",
    "description": "Green Land Convent Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131029. Address of the school is: Green Land Convent School, Raibha Road,  Achnera, Agra. Email address of the school is greenland54501@gmail.com.Read More"
  },
  {
    "name": "Green Land Convent School",
    "link": "https://www.cbseschool.org/green-land-convent-school-uttar-pradesh/",
    "description": "Founded in 2017,Green Land Convent Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133295. Address of the school is: Saiyan Road Kheragarh. Email address of the school is greenlandunit2@gmail.com. The school is being managed by Green Land Educational Society.Read More"
  },
  {
    "name": "Heritage Global School",
    "link": "https://www.cbseschool.org/heritage-global-school-uttar-pradesh/",
    "description": "Founded in 2016,Heritage Global Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132971. Address of the school is: Vill.- Dawli, Kiraoli, Agra. Email address of the school is heritageglobalschool5@gmail.com. The school is being managed by Heritage Global Charitable Trust.Read More"
  },
  {
    "name": "Heritage Public School",
    "link": "https://www.cbseschool.org/heritage-public-school-agra-uttar-pradesh/",
    "description": "Heritage Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131702. Address of the school is: 11/a/111, F Nandlalpur, Hathras Road Agra. Email address of the school is heritagepublicschool04@gmail.com.Read More"
  },
  {
    "name": "Heritage Public School",
    "link": "https://www.cbseschool.org/heritage-public-school-uttar-pradesh/",
    "description": "Founded in 2016,Heritage Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133279. Address of the school is: Vill Mitawali Bharan Road Agra. Email address of the school is heritagepsagra@gmail.com. The school is being managed by Heritage Educational Trust.Read More"
  },
  {
    "name": "Hillman Public School",
    "link": "https://www.cbseschool.org/hillman-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2005,Hillman Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130895. Address of the school is: Ladamada, Bichpuri, Agra, Up. Email address of the school is pokhariyal@hotmail.com. The school is being managed by Shri Radhakrishna Shiksha Evam Sanskratik Samiti.Read More"
  },
  {
    "name": "Holy Light Public School",
    "link": "https://www.cbseschool.org/holy-light-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2013,Holy Light Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131988. Address of the school is: Fatehpur Sikri Road Laramda Agra Up. Email address of the school is holylightschool@gmail.com. The school is being managed by Som Holy Light Public School Shiksha Samiti.Read More"
  },
  {
    "name": "Holy Public Junior College",
    "link": "https://www.cbseschool.org/holy-public-junior-college-uttar-pradesh/",
    "description": "Founded in 1986,Holy Public Junior Collegeis a Secondary School, affiliated to CBSE. Affiliation ID is 2130874. Address of the school is: S-4 Avas Vikas Colony Sikandra Boua Yojna Agra Uttar Pradesh. Email address of the school is neelima.hpjc@gmail.com.Read More"
  },
  {
    "name": "Holy Public School",
    "link": "https://www.cbseschool.org/holy-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1979,Holy Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130127. Address of the school is: Sikandra Road Agra Uttar Pradesh. Email address of the school is rtomar45@gmail.com. The school is being managed by Holy Nursery School Samiti.Read More"
  },
  {
    "name": "Indian Era Public School",
    "link": "https://www.cbseschool.org/indian-era-public-school-uttar-pradesh/",
    "description": "Founded in 2017,Indian Era Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133182. Address of the school is: Devipuram Kaharai Road Agra Up. Email address of the school is indianerapublicschoolagra@gmail.com. The school is being managed by Smt Raj Shiksha Samiti.Read More"
  },
  {
    "name": "J Milton Public School",
    "link": "https://www.cbseschool.org/j-milton-public-school-uttar-pradesh/",
    "description": "Founded in 2016,J Milton Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132866. Address of the school is: Barhan Road Etmadpur. Email address of the school is jmpsetmadpur@gmail.com. The school is being managed by A Milton Siksha Evam Vikas Samiti.Read More"
  },
  {
    "name": "J.D.N. School",
    "link": "https://www.cbseschool.org/j-d-n-school-uttar-pradesh/",
    "description": "Founded in 2006,J.D.N. Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132978. Address of the school is: Bagh Rohta Gwalior Road Bamroli Lane Agra. Email address of the school is dr.ajaychaudhary011@gmail.com. The school is being managed by Janki Devi Memorial Trust.Read More"
  },
  {
    "name": "J.J.S. Public School",
    "link": "https://www.cbseschool.org/j-j-s-public-school-uttar-pradesh/",
    "description": "Founded in 2011,J.J.S. Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133438. Address of the school is: Kakarari, Post Kakua, Baroli Aheer, Agra. Email address of the school is jjspublicschool@gmail.com. The school is being managed by J.j.s. Trust.Read More"
  },
  {
    "name": "J.R.M. International School",
    "link": "https://www.cbseschool.org/j-r-m-international-school-uttar-pradesh/",
    "description": "Founded in 2015,J.R.M. International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132570. Address of the school is: Vill- Sahai ,achnera Road Bichpuri Agra. Email address of the school is jrminternationalschool2015@gmail.com. The school is being managed by Jrm Charitable Educational Trust.Read More"
  },
  {
    "name": "Jawahar Navodaya Vidyalaya",
    "link": "https://www.cbseschool.org/jawahar-navodaya-vidyalaya-uttar-pradesh-20/",
    "description": "Founded in 1988,Jawahar Navodaya Vidyalayais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2140019. Address of the school is: Kolara Kalan Distt Agra Uttar Pradesh. Email address of the school is jnv87agra@gmail.com. The school is being managed by Navodaya Vidyalaya Samiti.Read More"
  },
  {
    "name": "Jim Corbett Public School",
    "link": "https://www.cbseschool.org/jim-corbett-public-school-agra-uttar-pradesh/",
    "description": "Jim Corbett Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131835. Address of the school is: 44,r.k.puram,gallana Road,agra,up. Email address of the school is jimcorbett97@gmail.com.Read More"
  },
  {
    "name": "John Milton Public School",
    "link": "https://www.cbseschool.org/john-milton-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1996,John Milton Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130308. Address of the school is: Nehru Enclave, Shamsabad Road, Agra Uttar Pradesh. Email address of the school is purumam@gmail.com. The school is being managed by J Milton Shiksha Samiti.Read More"
  },
  {
    "name": "K.M.Public School",
    "link": "https://www.cbseschool.org/k-m-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2004,K.M.Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131018. Address of the school is: Kirawali,agra. Email address of the school is knpublicschool@yahoo.com. The school is being managed by Shiva Shiksha Samiti.Read More"
  },
  {
    "name": "K.S.I. College",
    "link": "https://www.cbseschool.org/k-s-i-college-uttar-pradesh/",
    "description": "Founded in 2012,K.S.I. Collegeis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132724. Address of the school is: Patholi Agra. Email address of the school is ksicollege20@gmail.com. The school is being managed by K S Shiksha Samiti.Read More"
  },
  {
    "name": "Kendriya Vidyalaya No 1",
    "link": "https://www.cbseschool.org/kendriya-vidyalaya-no-1-uttar-pradesh-3/",
    "description": "Founded in 1963,Kendriya Vidyalaya No 1is a Senior Secondary, affiliated to CBSE. Affiliation ID is 2100001. Address of the school is: Air Force Station Agra Uttar Pradesh. Email address of the school is drhpsingh1972@gmail.com. The school is being managed by Kendriya Vidyalaya Sangathan.Read More"
  },
  {
    "name": "Kendriya Vidyalaya No 2",
    "link": "https://www.cbseschool.org/kendriya-vidyalaya-no-2-uttar-pradesh-2/",
    "description": "Founded in 1964,Kendriya Vidyalaya No 2is a Senior Secondary, affiliated to CBSE. Affiliation ID is 2100002. Address of the school is: Grand Parade Road Agra Cantt Uttar Pradesh. Email address of the school is principalkv2agracantt@gmail.com. The school is being managed by Kendriya Vidyalaya Sangathan.Read More"
  },
  {
    "name": "Kendriya Vidyalaya No 3",
    "link": "https://www.cbseschool.org/kendriya-vidyalaya-no-3-uttar-pradesh/",
    "description": "Founded in 1986,Kendriya Vidyalaya No 3is a Senior Secondary, affiliated to CBSE. Affiliation ID is 2100063. Address of the school is: Agra Cantt Barrack Road Uttar Pradesh. Email address of the school is PRINCIPALKV3AGRA@GMAIL.COM. The school is being managed by Kendriya Vidyalaya Sangathan.Read More"
  },
  {
    "name": "Krishna International School",
    "link": "https://www.cbseschool.org/krishna-international-school-agra-uttar-pradesh/",
    "description": "Founded in 2012,Krishna International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132226. Address of the school is: Vill. Hingot Kheria, Bamrauli Katara, Agra. Email address of the school is principal@kisa.co.in. The school is being managed by Lord Shir Banke Bihari Educational& Welfare Society, Krishna Palace, Vill. Mahua Khera, Agra.Read More"
  },
  {
    "name": "Kunal Public School",
    "link": "https://www.cbseschool.org/kunal-public-school-uttar-pradesh/",
    "description": "Founded in 2014,Kunal Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132892. Address of the school is: Nh-3 Tehra Gwalior Road Agra. Email address of the school is kunalpublicschool2012@gmail.com. The school is being managed by Vansh Educational Charitable Trust.Read More"
  },
  {
    "name": "Lifeline Public School",
    "link": "https://www.cbseschool.org/lifeline-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2001,Lifeline Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131214. Address of the school is: C-1/c-2, Site-c, U.p.s.i.d.c., Sikandara. Email address of the school is chauhanms176@gmail.com. The school is being managed by Shakuntla Devi Educational Trust.Read More"
  },
  {
    "name": "Little Angels School",
    "link": "https://www.cbseschool.org/little-angels-school-agra-uttar-pradesh/",
    "description": "Founded in 1997,Little Angels Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132529. Address of the school is: Block-c,trans Yamuna Colony,phase-1,agra. Email address of the school is vinaytbn@rediffmail.com. The school is being managed by Little Angels Educational Society,agra..Read More"
  },
  {
    "name": "Lord Krishna Public School Unit-2",
    "link": "https://www.cbseschool.org/lord-krishna-public-school-unit-2-uttar-pradesh/",
    "description": "Founded in 2017,Lord Krishna Public School Unit-2is a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133195. Address of the school is: Raibha, Runkata Bye Pass Road, Agra. Email address of the school is lordkrishnapublicschoolunit2@gmail.com. The school is being managed by Pushpa Devi Educational Trust.Read More"
  },
  {
    "name": "M S Public School",
    "link": "https://www.cbseschool.org/m-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2009,M S Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131333. Address of the school is: Vill +post -midhakur,. Email address of the school is mspublicschool@gmail.com. The school is being managed by M.s. Siksha Samiti. Vill+post-midhakur,agra.Read More"
  },
  {
    "name": "M.R. Convent School",
    "link": "https://www.cbseschool.org/m-r-convent-school-agra-uttar-pradesh/",
    "description": "Founded in 2009,M.R. Convent Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2131866. Address of the school is: Nh-2 Agra Firozabad Road,nawalpur,etmadpur,agra. Email address of the school is nirupamgupta08@gmail.com. The school is being managed by M.r. Gupta Charitable Trust.Read More"
  },
  {
    "name": "Maa Bhagwati Public School",
    "link": "https://www.cbseschool.org/maa-bhagwati-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2001,Maa Bhagwati Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2130812. Address of the school is: Vayu Vihar Colony Patholi Fatehpur Sikri Road Agra Up. Email address of the school is rprai.home01@gmail.com. The school is being managed by Maa Bhagwati Public School Society.Read More"
  },
  {
    "name": "Mahi International School",
    "link": "https://www.cbseschool.org/mahi-international-school-agra-uttar-pradesh/",
    "description": "Founded in 2010,Mahi International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132192. Email address of the school is principalmahi@gmail.com. The school is being managed by Matarani Trust.Read More"
  },
  {
    "name": "Manglik Shiksha Kendra",
    "link": "https://www.cbseschool.org/manglik-shiksha-kendra-agra-uttar-pradesh/",
    "description": "Founded in 1999,Manglik Shiksha Kendrais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130690. Address of the school is: Bamrouli Katra Fatehabad Road Agra Uttar Pradesh. Email address of the school is mskagraup1@gmail.com. The school is being managed by P C Mangalick Public Charitable Trust.Read More"
  },
  {
    "name": "Milton Public School",
    "link": "https://www.cbseschool.org/milton-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1986,Milton Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130213. Address of the school is: Ashok Vihar Kedar Nagar Shahganj  Agra Uttar Pradesh. Email address of the school is prachirajkul@gmail.com. The school is being managed by Milton Pub Sch Samiti.Read More"
  },
  {
    "name": "Mother R. D. Convent School",
    "link": "https://www.cbseschool.org/mother-r-d-convent-school-agra-uttar-pradesh/",
    "description": "Founded in 2007,Mother R. D. Convent Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131091. Address of the school is: Nai Awadi, Dhanouli, Agra. Email address of the school is motherrdconvent@gmail.com. The school is being managed by Maa Rehna Devi Shiksha Samiti Nai Awadi, Dhanouli Agra.Read More"
  },
  {
    "name": "Mount Litera Zee School Agra",
    "link": "https://www.cbseschool.org/mount-litera-zee-school-agra-agra-uttar-pradesh/",
    "description": "Founded in 2012,Mount Litera Zee School Agrais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131976. Address of the school is: Village Nofrishamshabad Road Agra Up. Email address of the school is principal@mlzsagra.com. The school is being managed by Smt Savitri Devi Educational Charitable Trust.Read More"
  },
  {
    "name": "N.D.Jain School",
    "link": "https://www.cbseschool.org/n-d-jain-school-agra-uttar-pradesh/",
    "description": "Founded in 2004,N.D.Jain Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131475. Address of the school is: Bah Tahsil Agra. Email address of the school is geniobhaskar@gmail.com. The school is being managed by Nemi Nath Digamber Jain Trust Samiti.Read More"
  },
  {
    "name": "Nemi Chand Educational Acdemy",
    "link": "https://www.cbseschool.org/nemi-chand-educational-acdemy-agra-uttar-pradesh/",
    "description": "Founded in 2008,Nemi Chand Educational Acdemyis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131256. Address of the school is: Puramana, Kiraoli. Email address of the school is NCEAHARIKANT5@GMAIL.COM. The school is being managed by Shri Nemi Chand Charatable Trust.Read More"
  },
  {
    "name": "New St Stephens  Public School Unit-Ii",
    "link": "https://www.cbseschool.org/new-st-stephens-public-school-unit-ii-agra-uttar-pradesh/",
    "description": "New St Stephens  Public School Unit-Iiis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132179. Address of the school is: Opp.shri Siddh Ashram Sawai, Barhan Road,etmadpur Agra. Email address of the school is ns5agrau2@gmail.com.Read More"
  },
  {
    "name": "New St Stephens Public School",
    "link": "https://www.cbseschool.org/new-st-stephens-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1998,New St Stephens Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130515. Address of the school is: Kalindi Vihar Agra Uttar Pradesh. Email address of the school is principal.ns5agra@gmail.com. The school is being managed by New St Stephens Shiksha Samiti.Read More"
  },
  {
    "name": "New St.Stephen Public School Unit-3",
    "link": "https://www.cbseschool.org/new-st-stephen-public-school-unit-3-agra-uttar-pradesh/",
    "description": "Founded in 2014,New St.Stephen Public School Unit-3is a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132257. Address of the school is: Faujigarhi Barhan Road, Anwalkhera, Agra. Email address of the school is ns3agra@gmail.com. The school is being managed by New St. Stephen Shiksha Samiti.Read More"
  },
  {
    "name": "P. S. Academy",
    "link": "https://www.cbseschool.org/p-s-academy-agra-uttar-pradesh/",
    "description": "Founded in 2013,P. S. Academyis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132163. Address of the school is: Village & Post Semra Distt. Agra. Email address of the school is PRINCIPALPSACADEMY@GMAIL.COM. The school is being managed by Bajrang Educational Trust.Read More"
  },
  {
    "name": "Police Modern School",
    "link": "https://www.cbseschool.org/police-modern-school-agra-uttar-pradesh/",
    "description": "Founded in 1996,Police Modern Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2180039. Address of the school is: 15 Bn Pac, Tajganj, Agra. Email address of the school is comdt15bn@UPPAC.in. The school is being managed by Up Police Shiksha Samiti, Lucknow.Read More"
  },
  {
    "name": "Police Modern School",
    "link": "https://www.cbseschool.org/police-modern-school-agra-uttar-pradesh-2/",
    "description": "Founded in 2001,Police Modern Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2180034. Address of the school is: Reserve Police Lines Agra Uttar Pradesh. Email address of the school is pramila.singla@yahoo.com. The school is being managed by Police Modern Sch Up Police Shi Sam.Read More"
  },
  {
    "name": "Police Modern School",
    "link": "https://www.cbseschool.org/police-modern-school-uttar-pradesh-10/",
    "description": "Founded in 2001,Police Modern Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130694. Address of the school is: Reserve Police Lines Agra Uttar Pradesh. Email address of the school is pramila.singla@yahoo.com. The school is being managed by Police Modern Sch Up Police Shi Sam.Read More"
  },
  {
    "name": "Police Modern School",
    "link": "https://www.cbseschool.org/police-modern-school-uttar-pradesh-14/",
    "description": "Founded in 1996,Police Modern Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2130954. Address of the school is: 15 Bn Pac, Tajganj, Agra. Email address of the school is comdt15bn@UPPAC.in. The school is being managed by Up Police Shiksha Samiti, Lucknow.Read More"
  },
  {
    "name": "Pooja Public School",
    "link": "https://www.cbseschool.org/pooja-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2004,Pooja Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131311. Address of the school is: Gopalpura,bhadroli Baah,agra. Email address of the school is poojaschool32@gmail.com. The school is being managed by Shiv Kripa Education Trust Samiti.Read More"
  },
  {
    "name": "Pradhan Public Higher Secondary School",
    "link": "https://www.cbseschool.org/pradhan-public-higher-secondary-school-agra-uttar-pradesh/",
    "description": "Founded in 2009,Pradhan Public Higher Secondary Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131540. Address of the school is: Jugsena, Singna, Distt Agra, U.p.. Email address of the school is pradhanpublicschool@gmail.com. The school is being managed by Ganga Devi Siksha Samiti.Read More"
  },
  {
    "name": "Prelude Public School",
    "link": "https://www.cbseschool.org/prelude-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2003,Prelude Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130649. Address of the school is: 341 Jaganpur Dayal Bagh Agra Uttar Pradesh. Email address of the school is preludepublicschool@yahoo.com. The school is being managed by Saraswati Educational Chari Trust.Read More"
  },
  {
    "name": "Premier International School",
    "link": "https://www.cbseschool.org/premier-international-school-agra-uttar-pradesh/",
    "description": "Founded in 1992,Premier International Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2130816. Address of the school is: 3 Gailana Road Agra Delhi Highway Agra Up. Email address of the school is pisagra@outlook.com. The school is being managed by Shri Sant Sahju Shiksha Samiti.Read More"
  },
  {
    "name": "Queen Victoria Girls School",
    "link": "https://www.cbseschool.org/queen-victoria-girls-school-uttar-pradesh/",
    "description": "Founded in 2015,Queen Victoria Girls Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133153. Address of the school is: Delhi Gate Agra. Email address of the school is queenvictoria.gs@gmail.com. The school is being managed by Agra Dioceson Trust Association.Read More"
  },
  {
    "name": "R. V. Public School",
    "link": "https://www.cbseschool.org/r-v-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2012,R. V. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131798. Address of the school is: Garhi Thakur Das, Patti Panchgai Agra. Email address of the school is ksraghuvanshi1987@gmail.com. The school is being managed by N.d.educational Trust.Read More"
  },
  {
    "name": "Radhaballabh Public School",
    "link": "https://www.cbseschool.org/radhaballabh-public-school-agra-uttar-pradesh/",
    "description": "Radhaballabh Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130938. Address of the school is: Amar Vihar, Dayalbagh, Distt Agra, Uttar Pradesh. Email address of the school is rbpsagra@gmail.com.Read More"
  },
  {
    "name": "Ramesh Chand Sharma Memorial Vidyalaya",
    "link": "https://www.cbseschool.org/ramesh-chand-sharma-memorial-vidyalaya-agra-uttar-pradesh/",
    "description": "Founded in 2014,Ramesh Chand Sharma Memorial Vidyalayais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132307. Address of the school is: Village Nanpur, Post Sahara, Agra. Email address of the school is rcsmvagra@gmail.com. The school is being managed by Hindi Shiksha Samiti.Read More"
  },
  {
    "name": "Rasa  International School",
    "link": "https://www.cbseschool.org/rasa-international-school-uttar-pradesh/",
    "description": "Founded in 2018,Rasa  International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133335. Address of the school is: Dulhara Road Fatehpur Sikri Agra. Email address of the school is rasainternationalschool2019@gmail.com. The school is being managed by Rasa Educational Trust.Read More"
  },
  {
    "name": "Rising Sun Premier School",
    "link": "https://www.cbseschool.org/rising-sun-premier-school-uttar-pradesh/",
    "description": "Rising Sun Premier Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133812. Address of the school is: Danda Crossing, Jagner, Agra, Danda Crossing, Jagner, Agra. Email address of the school is risingsunjagner2019@gmail.com. The school is being managed by Farooq Hussain Memorial Educational And Charitable  Trust.Read More"
  },
  {
    "name": "Roy Vidya Vihar",
    "link": "https://www.cbseschool.org/roy-vidya-vihar-agra-uttar-pradesh/",
    "description": "Founded in 2005,Roy Vidya Viharis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131250. Address of the school is: Ektra Road Bamrauli Katara, Agra. Email address of the school is SHARMAHARENDRA100@GMAIL.COM. The school is being managed by Vishnu Shobha Shiksha Evam Sanskar Prasar Samiti.Read More"
  },
  {
    "name": "S S Public School",
    "link": "https://www.cbseschool.org/s-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1996,S S Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130470. Address of the school is: Sewla Sarai Gwalior Road Agra Uttar Pradesh. Email address of the school is singhshikhaa2@gmail.com. The school is being managed by Samagra Shiksha Sansthan.Read More"
  },
  {
    "name": "S. G. Public School",
    "link": "https://www.cbseschool.org/s-g-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2011,S. G. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131997. Address of the school is: Akola Agra Up.. Email address of the school is sgpschool1313@gmail.com. The school is being managed by Shri Radha Ballabh Siksha Samiti.Read More"
  },
  {
    "name": "S.K.D. Public School",
    "link": "https://www.cbseschool.org/s-k-d-public-school-uttar-pradesh/",
    "description": "Founded in 2012,S.K.D. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133109. Address of the school is: Shamshabad Road,vill-ghaghpura,teh- Fathebad Dist Agra. Email address of the school is skdschoolagra2011@gmail.com. The school is being managed by Smt Karuna Dev Jankalyan  Shiksha Samiti.Read More"
  },
  {
    "name": "S.R.D.Public School",
    "link": "https://www.cbseschool.org/s-r-d-public-school-uttar-pradesh/",
    "description": "Founded in 2015,S.R.D.Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132940. Address of the school is: Gram-gothara,fatehpur Sikri,agra. Email address of the school is srdpublicschool123@gmail.com. The school is being managed by Shri Rameshwar  Dayal Parashar Shiksha Samiti.Read More"
  },
  {
    "name": "S.R.D.Public School Akola",
    "link": "https://www.cbseschool.org/s-r-d-public-school-akola-agra-uttar-pradesh/",
    "description": "Founded in 2003,S.R.D.Public School Akolais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131148. Address of the school is: Village & P.o. Akola. Email address of the school is rajalokpal@gmail.com. The school is being managed by Smt. Ram Lata Devi Shiksha Samiti, Akola (agra).Read More"
  },
  {
    "name": "S.S.C. Memorial Public School",
    "link": "https://www.cbseschool.org/s-s-c-memorial-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2013,S.S.C. Memorial Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132310. Address of the school is: Nagla Jasola, Kagarol, Agra. Email address of the school is principalsscmps@gmail.com. The school is being managed by U. I. Welfare Society.Read More"
  },
  {
    "name": "Sachdeva Millennium School",
    "link": "https://www.cbseschool.org/sachdeva-millennium-school-agra-uttar-pradesh/",
    "description": "Founded in 2009,Sachdeva Millennium Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131215. Address of the school is: Dehtora, Shastripuram, Agra, Uttar Pradesh. Email address of the school is smsagra@yahoo.co.in. The school is being managed by Dhanpat Rai Sachdeva Memorial Charitable Trust.Read More"
  },
  {
    "name": "Sanskar Public School",
    "link": "https://www.cbseschool.org/sanskar-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2014,Sanskar Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132209. Address of the school is: Village Baad , Post Kakua , Gwalior Road Barauli Aheer Distt. Agra. Email address of the school is sanskarschoolbaad@gmail.com. The school is being managed by Sanskar Educational Development Trust.Read More"
  },
  {
    "name": "Sant Asaramji Public School",
    "link": "https://www.cbseschool.org/sant-asaramji-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1989,Sant Asaramji Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130775. Address of the school is: Mathura Road Sikandra Agra Up. Email address of the school is agra_ssaps@yahoo.com. The school is being managed by Sant Shri Asaramji Edn Trust.Read More"
  },
  {
    "name": "Saraswati Vidya Mandir",
    "link": "https://www.cbseschool.org/saraswati-vidya-mandir-agra-uttar-pradesh/",
    "description": "Founded in 1992,Saraswati Vidya Mandiris a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130136. Address of the school is: Kamla Nagar Agra Uttar Pradesh. Email address of the school is svmknagra@yahoo.in. The school is being managed by Saraswati Shiksha Parishad Agra.Read More"
  },
  {
    "name": "Shanti Niketan Public School",
    "link": "https://www.cbseschool.org/shanti-niketan-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2006,Shanti Niketan Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130929. Address of the school is: Nh - 3, Agra - Gwalior Road, Village - Tehra, Distt Agra, Uttar Pradesh. Email address of the school is sadaa_vijay@yahoo.com. The school is being managed by Swarajya Educational & Welfare Society.Read More"
  },
  {
    "name": "Shanti Niketan Public School",
    "link": "https://www.cbseschool.org/shanti-niketan-public-school-agra-uttar-pradesh-2/",
    "description": "Founded in 2011,Shanti Niketan Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132210. Address of the school is: Nadganwa Road,pinahat,agra. Email address of the school is snpspnht@gmail.com. The school is being managed by Ashutosh Anand Edu. Trust.Read More"
  },
  {
    "name": "Shivalik Cambridge College",
    "link": "https://www.cbseschool.org/shivalik-cambridge-college-agra-uttar-pradesh/",
    "description": "Founded in 1998,Shivalik Cambridge Collegeis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130554. Address of the school is: Sector-7, Awas Vikas Colony Sikandra Agra Uttar Pradesh. Email address of the school is mdshivalik@gmail.com. The school is being managed by Shiva Shiksha Samiti.Read More"
  },
  {
    "name": "Shivalik Public School",
    "link": "https://www.cbseschool.org/shivalik-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2006,Shivalik Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130952. Address of the school is: Magtai-bhichpuri Road, Distt Agra, Uttar Pradesh. Email address of the school is kumarbhargava@yahoo.com. The school is being managed by Shiva Shiskha Samiti, Avas Vikas Colony Sec-7, Sikandra, Agra-7.Read More"
  },
  {
    "name": "Shree Kunji Lal Gulkandi Devi Public School",
    "link": "https://www.cbseschool.org/shree-kunji-lal-gulkandi-devi-public-school-agra-uttar-pradesh/",
    "description": "Shree Kunji Lal Gulkandi Devi Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131786. Address of the school is: Kheragarh Road Kagarol. Email address of the school is sklgdpublicschool@rediffmail.com.Read More"
  },
  {
    "name": "Shri Mahaveer Ji Public School",
    "link": "https://www.cbseschool.org/shri-mahaveer-ji-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2014,Shri Mahaveer Ji Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132262. Address of the school is: Garhi Gusai (garhi Dariyav) Fatehabad. Email address of the school is mdpcollege@gmail.com. The school is being managed by Shri Mahaveer Ji Shiksha Samitti.Read More"
  },
  {
    "name": "Shri Mankameshwar Bal Vidalaya",
    "link": "https://www.cbseschool.org/shri-mankameshwar-bal-vidalaya-agra-uttar-pradesh/",
    "description": "Founded in 2014,Shri Mankameshwar Bal Vidalayais a Secondary School, affiliated to CBSE. Affiliation ID is 2132517. Address of the school is: Gadi  Ishwara,digner-shamshabad Road Agra. Email address of the school is mankameshwarpublicschool@yahoo.co.in. The school is being managed by Shri Mamkameshwar Dharmarth Hospital.Read More"
  },
  {
    "name": "Shri R.S. Public School",
    "link": "https://www.cbseschool.org/shri-r-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2004,Shri R.S. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131203. Address of the school is: Bainpur Road, Sikandra, Agra, Uttar Pradesh. Email address of the school is srspsagra@gmail.com. The school is being managed by Shri R. S. Jan Kalyan Shiksha Samiti.Read More"
  },
  {
    "name": "Shri Rajendra Singh College",
    "link": "https://www.cbseschool.org/shri-rajendra-singh-college-agra-uttar-pradesh/",
    "description": "Founded in 2014,Shri Rajendra Singh Collegeis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132543. Address of the school is: Dhimishri,fatehabad. Email address of the school is shrirajendrasinghcollege@gmail.com. The school is being managed by Shri Rajerndra Singh Charitable Trust.Read More"
  },
  {
    "name": "Shri Ram Centennial School",
    "link": "https://www.cbseschool.org/shri-ram-centennial-school-agra-uttar-pradesh/",
    "description": "Founded in 2012,Shri Ram Centennial Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131916. Address of the school is: Poiya Ghat,dayal Bagh , Agra. Email address of the school is vandana.ghosh@srcsagra.org. The school is being managed by Satyawati Subodh Foundation.Read More"
  },
  {
    "name": "Shri Ram International School",
    "link": "https://www.cbseschool.org/shri-ram-international-school-uttar-pradesh/",
    "description": "Founded in 2015,Shri Ram International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132894. Address of the school is: Shri Ram International School,panwari Agra U. P.. Email address of the school is kavyapal12@gmail.com. The school is being managed by Sri Ramadarsh Shiksha Samiti.Read More"
  },
  {
    "name": "Simpkins School",
    "link": "https://www.cbseschool.org/simpkins-school-agra-uttar-pradesh/",
    "description": "Founded in 1982,Simpkins Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130149. Address of the school is: Maruti Estate Bodla Road New Shahganj Agra Uttar Pradesh. Email address of the school is principal@simpkins.co.in. The school is being managed by Simpkins School.Read More"
  },
  {
    "name": "Smt Sridevi Awasiya Vidyapeeth",
    "link": "https://www.cbseschool.org/smt-sridevi-awasiya-vidyapeeth-agra-uttar-pradesh/",
    "description": "Founded in 2001,Smt Sridevi Awasiya Vidyapeethis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130796. Address of the school is: Vamanpura Kirwali Agra Up. Email address of the school is sridevischool@live.com. The school is being managed by Smt Sridevi Residential Sch Soc.Read More"
  },
  {
    "name": "Springdale Modern Public School",
    "link": "https://www.cbseschool.org/springdale-modern-public-school-uttar-pradesh/",
    "description": "Founded in 1996,Springdale Modern Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132733. Address of the school is: Malpura. Email address of the school is shashigupta27061958@gmail.com. The school is being managed by Universal Brotherhood And Educational Development Society.Read More"
  },
  {
    "name": "St Vivekanand Public School",
    "link": "https://www.cbseschool.org/st-vivekanand-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1979,St Vivekanand Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2130587. Address of the school is: Kabulpur Kakna Gwalior Road, Agra Uttar Pradesh. Email address of the school is st_vps4386@rediffmail.com. The school is being managed by St Vivekanand Pub Sch Edu Samiti.Read More"
  },
  {
    "name": "St. Andrew's Public School",
    "link": "https://www.cbseschool.org/st-andrews-public-school-agra-uttar-pradesh/",
    "description": "Founded in 1991,St. Andrew's Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130190. Address of the school is: North Karmayogi, Kamla Nagar, Agra Uttar Pradesh. Email address of the school is agra_vikasgoyal@yahoo.co.in. The school is being managed by St Andrews Pub Sch Society.Read More"
  },
  {
    "name": "St. Andrews School",
    "link": "https://www.cbseschool.org/st-andrews-school-agra-uttar-pradesh/",
    "description": "Founded in 2006,St. Andrews Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131173. Address of the school is: Baroli Aheer, Shamshabad Road, Agra. Email address of the school is PARASHARRAHUL1973@GMAIL.COM. The school is being managed by St. Andrews Public School Society.Read More"
  },
  {
    "name": "St. Augustine  School",
    "link": "https://www.cbseschool.org/st-augustine-school-agra-uttar-pradesh/",
    "description": "Founded in 1984,St. Augustine  Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130243. Address of the school is: 4/68 Gwalior Road Agra Uttar Pradesh. Email address of the school is SHIFALICAMPBELL@GMAIL.COM. The school is being managed by St Angustine School Agra Society.Read More"
  },
  {
    "name": "St. C. F. Andrews School",
    "link": "https://www.cbseschool.org/st-c-f-andrews-school-agra-uttar-pradesh/",
    "description": "Founded in 2004,St. C. F. Andrews Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130912. Address of the school is: Piplipokhar Hatras Road, Agra. Email address of the school is agra_vikasgoyal@yahoo.co.in. The school is being managed by St Cf Andrews School Society.Read More"
  },
  {
    "name": "St. Clare's School",
    "link": "https://www.cbseschool.org/st-clares-school-uttar-pradesh/",
    "description": "St. Clare's Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2133781. Address of the school is: Deori Road, Agra. Email address of the school is stclares2@gmail.com. The school is being managed by Roman Catholic Diocese Of Agra Education Society.Read More"
  },
  {
    "name": "St. Clares High School",
    "link": "https://www.cbseschool.org/st-clares-high-school-uttar-pradesh/",
    "description": "Founded in 1957,St. Clares High Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130080. Address of the school is: 118 Prithvi Raj Road Agra Cantt Uttar Pradesh. Email address of the school is stclaresagra@rediffmail.com. The school is being managed by Roman Catholic Diocese Of Agra.Read More"
  },
  {
    "name": "St. Francis Convent School",
    "link": "https://www.cbseschool.org/st-francis-convent-school-agra-uttar-pradesh/",
    "description": "Founded in 2005,St. Francis Convent Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2130985. Address of the school is: Upsidc Road, Ghoghai, Sikandra, Agra (up). Email address of the school is zitacfmss@gmail.com. The school is being managed by The Institute Of The Franciscan Clarist Sisters Of The Most Blessed Sacrament Society.Read More"
  },
  {
    "name": "St. Francis Convent School",
    "link": "https://www.cbseschool.org/st-francis-convent-school-uttar-pradesh/",
    "description": "Founded in 1873,St. Francis Convent Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2130250. Address of the school is: Wazirpura Road Agra Uttar Pradesh. Email address of the school is abhapullokaran@rediffmail.com. The school is being managed by Franciscan Clarist Sister.Read More"
  },
  {
    "name": "St. Marks Public School",
    "link": "https://www.cbseschool.org/st-marks-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2005,St. Marks Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131098. Address of the school is: Village & Post Bhagupur, Kuberpur, Tehsil Etmadpur, Agra. Email address of the school is agra_vikasgoyal@yahoo.co.in. The school is being managed by St Marks School Shiksha Samiti.Read More"
  },
  {
    "name": "St. Queen Mary's Public School",
    "link": "https://www.cbseschool.org/st-queen-marys-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2003,St. Queen Mary's Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130248. Address of the school is: Tehra Gwalior Road Agra Uttar Pradesh. Email address of the school is geetadutt84@gmail.com. The school is being managed by Bibi Amar Kaur Educational Society.Read More"
  },
  {
    "name": "St. R.S. Public School",
    "link": "https://www.cbseschool.org/st-r-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2012,St. R.S. Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132391. Address of the school is: Semra Road,khandoli,agra. Email address of the school is mcguptaadv@gmail.com. The school is being managed by Shri Ramhans Sonpal Siksha Samiti.Read More"
  },
  {
    "name": "St. V.S. Public School",
    "link": "https://www.cbseschool.org/st-v-s-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2014,St. V.S. Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132343. Address of the school is: C-2, Shastri Puram Agra. Email address of the school is svsps2013@gmail.com. The school is being managed by V S Educational Academy.Read More"
  },
  {
    "name": "Sumeet Rahul Goyal Memorial High Sch",
    "link": "https://www.cbseschool.org/sumeet-rahul-goyal-memorial-high-sch-agra-uttar-pradesh/",
    "description": "Founded in 1991,Sumeet Rahul Goyal Memorial High Schis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130367. Address of the school is: Agra Uttar Pradesh. Email address of the school is chauhanramanand.s@gmail.com. The school is being managed by Summet Rahul Goel Memorial Shi Smt.Read More"
  },
  {
    "name": "Sun Flower Public School",
    "link": "https://www.cbseschool.org/sun-flower-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2008,Sun Flower Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2131168. Address of the school is: 164, Allora Enclave, Dayal Bagh. Email address of the school is animeshdayal@gmail.com. The school is being managed by Sun Flower Institutional Society.Read More"
  },
  {
    "name": "Sun Lord Public School",
    "link": "https://www.cbseschool.org/sun-lord-public-school-uttar-pradesh/",
    "description": "Founded in 2014,Sun Lord Public Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132587. Address of the school is: Vill. Lohkarera, Runakata, Agra. Email address of the school is ravisharmasps48@gmail.com. The school is being managed by M.p. Education Society, Lohkarera, Runakata Kiraoli, Agra.Read More"
  },
  {
    "name": "Sun Shine School",
    "link": "https://www.cbseschool.org/sun-shine-school-agra-uttar-pradesh/",
    "description": "Founded in 2011,Sun Shine Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132401. Address of the school is: Naumeel Chauraha ,mankenda,agra. Email address of the school is sunshineschoolagra@gmail.com. The school is being managed by Sun Shine School Jan Kalyan Shiksha Samiti.Read More"
  },
  {
    "name": "Suraj Govind Senior Secondary School",
    "link": "https://www.cbseschool.org/suraj-govind-senior-secondary-school-agra-uttar-pradesh/",
    "description": "Founded in 2000,Suraj Govind Senior Secondary Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131170. Address of the school is: 282007. Email address of the school is surajgovindschool@gmail.com. The school is being managed by Suraj Govind Senior Secondary School Trust Society.Read More"
  },
  {
    "name": "Symboyzia School",
    "link": "https://www.cbseschool.org/symboyzia-school-agra-uttar-pradesh/",
    "description": "Founded in 2000,Symboyzia Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130616. Address of the school is: New Govind Nagar Shahiganj Agra Uttar Pradesh. Email address of the school is SYMBOYZIAGROUP@GMAIL.COM. The school is being managed by Symbozia Shiksha Samiti.Read More"
  },
  {
    "name": "Tagore Public School",
    "link": "https://www.cbseschool.org/tagore-public-school-agra-uttar-pradesh/",
    "description": "Founded in 2004,Tagore Public Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2131109. Address of the school is: Sewla Sarai, Gwalior Road. Email address of the school is vinaytbn@rediffmail.com. The school is being managed by Tagore Public School Samiti.Read More"
  },
  {
    "name": "The International School Agra",
    "link": "https://www.cbseschool.org/the-international-school-agra-agra-uttar-pradesh/",
    "description": "Founded in 2015,The International School Agrais a Senior Secondary, affiliated to CBSE. Affiliation ID is 2132511. Address of the school is: 9th Mile Stone,bamrauli Katara,fatehabad Road,agra. Email address of the school is principal@tisagra.ac.in. The school is being managed by Shanta Educational Academy.Read More"
  },
  {
    "name": "The Laurence School",
    "link": "https://www.cbseschool.org/the-laurence-school-uttar-pradesh/",
    "description": "Founded in 2018,The Laurence Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2133548. Address of the school is: Village Kagarol ,district Agra. Email address of the school is indrapalsolanki3@gmail.com. The school is being managed by Raghuram Educational Society.Read More"
  },
  {
    "name": "University Model School",
    "link": "https://www.cbseschool.org/university-model-school-uttar-pradesh/",
    "description": "Founded in 1998,University Model Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2130632. Address of the school is: Dr. B.r. Ambedkar University, Khandrari Campus, Agra-282 002, Up. Email address of the school is SEEMAANWAR786@HOTMAIL.COM. The school is being managed by Dr B R Ambedkar Model School Soc.Read More"
  },
  {
    "name": "Vidhya International School",
    "link": "https://www.cbseschool.org/vidhya-international-school-uttar-pradesh/",
    "description": "Founded in 2015,Vidhya International Schoolis a Secondary School, affiliated to CBSE. Affiliation ID is 2132755. Address of the school is: 1292/86, Foundry Nagar. Email address of the school is pksharma12107@gmail.com. The school is being managed by Digambaraya Educational And Welfare Society.Read More"
  },
  {
    "name": "Vijaya International School",
    "link": "https://www.cbseschool.org/vijaya-international-school-agra-uttar-pradesh/",
    "description": "Founded in 2012,Vijaya International Schoolis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131644. Address of the school is: Bichpuri, Agra Up. Email address of the school is Vijayainternationalschool@yahoo.com. The school is being managed by Graminoutthan Shikshan Samiti Agra.Read More"
  },
  {
    "name": "Vijaya Maharani International Academy",
    "link": "https://www.cbseschool.org/vijaya-maharani-international-academy-agra-uttar-pradesh/",
    "description": "Founded in 2008,Vijaya Maharani International Academyis a Senior Secondary, affiliated to CBSE. Affiliation ID is 2131175. Address of the school is: Vijaya Maharani International Academy,achnera,agra. Email address of the school is vijayamaharani2012@gmail.com. The school is being managed by Gramy Vikas Sanstha.Read More"
  }
]